app/Http/Livewire/Main/Seller/Gigs/GigsComponent.php

    public function getGigsProperty()
    {
        // Get gigs by this seller
        $gigs = Gig::where('user_id', auth()->id())->latest()->paginate(42);
---
select * from `gigs` where `user_id` = 1 and `gigs`.`deleted_at` is null order by `created_at` desc limit 42 offset 0
select count(*) as aggregate from `gigs` where `user_id` = 1 and `gigs`.`deleted_at` is null