app/Http/Livewire/Main/Seller/Quotes/QuotesComponent.php

select count(*) as aggregate from `quotations` where `quotations`.`user_id` = 1
---
    public function getQuotationsProperty()
    {
        return Quotation::query()->authUser()->paginate(10);